        
                        exercise

1. From the movies data frame.
a. Count the missing values in the 'content_rating' column.
b. Return the rows containing any missing values, how many are they?
c. Return the unique values in the 'content_rating' column
d. Return the movies that are not rated and what is there number.
e. Return the movies with a higher rating than 9. How many are they?
2. Which country has the highest sum of beer_servings and spirit_servings.
3. Which continent has more beer servings, beer_servings spirit_servings wine_servings.
4. From every continent find the country with the highest beer_servings, spirit_servings,
wine_servings.
5. In West Africa which country has the lowest total liters of alcohol?
6. In East Africa which country has the highest intake of alcohol?
7. From the titanic data-set what is the average age of the survivors, what was the most
common Pclass and Sex.
8. Which sex recorded the most survivors according to the titanic data-set?
9. In North Africa which country drinks most?
10. From the SADC block which country is the third most consumer of Alcohol?
11. From the UFO data-set what is the overall memory usage? Which column has the highest
share of memory? How can u reduce the memory usage of some of the columns for this data
set? How much have you reduced the memory usage for the data-frame? Explain your
findings with code.
12. Which country from the G7 has the lowest total intake of Alcohol?
13. Which movies have the highest percentage via content_rating and genre.
14. Split your movies data-set into 2 parts called train with 70 percent of the data and test with
30 percent of the data. How many records does each of the splits have?
15. From the dataset “daily-total-female-births.csv” which month , day of the week, day of the
month and number of day of the year has the highest number of births?

##### some important libraries to be used

In [1]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy.special import log1p
from sklearn import preprocessing
from sklearn.decomposition import PCA
from random import random
from functools import reduce
%matplotlib inline

###### loading all dataframes we are going to deal with

In [130]:
drinks = pd.read_csv('drinks.csv')
movies = pd.read_csv('imdb_1000.csv')
titanic_train = pd.read_csv('titanic_train.csv')
ufo = pd.read_csv('ufo.csv')
female_births = pd.read_csv('daily-total-female-births.csv')

# question 1

From the movies data frame. 
a. Count the missing values in the 'content_rating' column.
b. Return the rows containing any missing values, how many are they?
c. Return the unique values in the 'content_rating' column 
d. Return the movies that are not rated and what is there number. 
e. Return the movies with a higher rating than 9. How many are they?

#####  a. Count the missing values in the 'content_rating' column

In [3]:

print('the total missing values in content_rating are {}'.format(movies.content_rating.isnull().sum()))

the total missing values in content_rating are 3

#####  b. Return the rows containing any missing values, how many are they?

In [4]:
# checking in dataframe where NUN are located

movies[movies.isnull().any(axis=1)]

,star_rating,title,content_rating,genre,duration,actors_list
187,8.2,Butch Cassidy and the Sundance Kid,NaN,Biography,110,"[u'Paul Newman', u'Robert Redford', u'Katharin..."
649,7.7,Where Eagles Dare,NaN,Action,158,"[u'Richard Burton', u'Clint Eastwood', u'Mary ..."
936,7.4,True Grit,NaN,Adventure,128,"[u'John Wayne', u'Kim Darby', u'Glen Campbell']"

In [5]:
# how many are they?

print('in our dataframe we have {} rows with missing values'.format(len(movies[movies.isnull().any(axis=1)])))

in our dataframe we have 3 rows with missing values

###### ohter alternative

In [6]:
# checking in dataframe where NUN are located
movies.isnull().any()

star_rating       False
title             False
content_rating     True
genre             False
duration          False
actors_list       False
dtype: bool

In [7]:
#rows containing any missing values becouse we know that is only content_rating with nun values

movies.loc[movies.content_rating.isnull()]

,star_rating,title,content_rating,genre,duration,actors_list
187,8.2,Butch Cassidy and the Sundance Kid,NaN,Biography,110,"[u'Paul Newman', u'Robert Redford', u'Katharin..."
649,7.7,Where Eagles Dare,NaN,Action,158,"[u'Richard Burton', u'Clint Eastwood', u'Mary ..."
936,7.4,True Grit,NaN,Adventure,128,"[u'John Wayne', u'Kim Darby', u'Glen Campbell']"

In [8]:
# how many are they?
print('in our dataframe we have {} rows with missing values'.format(len(movies.loc[movies.content_rating.isnull()])))

in our dataframe we have 3 rows with missing values

##### c. Return the unique values in the 'content_rating' column

In [9]:
movies.content_rating.unique().tolist()

print('the unique values in the content_rating column are \n\n{}'.format(movies.content_rating.unique().tolist()))

the unique values in the content_rating column are

['R', 'PG-13', 'NOT RATED', 'PG', 'UNRATED', 'APPROVED', 'PASSED', 'G', 'X', nan, 'TV-MA', 'GP', 'NC-17']

##### d. Return the movies that are not rated and what is there number.

In [10]:
# movies that are not rated with there coreesponding number

movies.loc[movies.content_rating.isnull(),'title',]

187    Butch Cassidy and the Sundance Kid
649                     Where Eagles Dare
936                             True Grit
Name: title, dtype: object

##### E.Return the movies with a higher rating than 9. 
##### How many are they?

In [11]:
# movies with a higher rating than 9

movies.loc[movies.star_rating>9]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."

In [12]:
# How many are they?

print('there is {} movies with a higher rating than 9'.format(len(movies.loc[movies.star_rating>9])))

there is 3 movies with a higher rating than 9

# question 2

###### Which country has the highest sum of beer_servings and spirit_servings.

In [13]:
drinks['b_s_servings'] = (drinks.beer_servings+drinks.spirit_servings)
drinks.loc[drinks.b_s_servings == max(drinks.b_s_servings),'country']


# print('{} is the  country which has the highest sum of beer_servings and spirit_servings'.format())

68    Grenada
Name: country, dtype: object

# Question 3

###### Which continent has more beer servings,  spirit_servings, wine_servings.

In [14]:
#  continent with more beer servings

drinks.loc[drinks.beer_servings == max(drinks.beer_servings),'continent']

117    Africa
Name: continent, dtype: object

In [15]:
#  continent with more spirit_servings

drinks.loc[drinks.spirit_servings == max(drinks.spirit_servings),'continent']

68    North America
Name: continent, dtype: object

In [16]:
#  continent with more wine_servings

drinks.loc[drinks.wine_servings == max(drinks.wine_servings),'continent']

61    Europe
Name: continent, dtype: object

# Question 4

###### From every continent find the country with the highest beer_servings, spirit_servings, wine_servings.

In [17]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,b_s_servings
0,Afghanistan,0,0,0,0.0,Asia,0
1,Albania,89,132,54,4.9,Europe,221
2,Algeria,25,0,14,0.7,Africa,25
3,Andorra,245,138,312,12.4,Europe,383
4,Angola,217,57,45,5.9,Africa,274

## dataframe for each continent in dataframe

In [18]:
df_Asia = drinks[drinks.continent == 'Asia']
df_Europe = drinks[drinks.continent == 'Europe']
df_Africa = drinks[drinks.continent == 'Africa']
df_North_America = drinks[drinks.continent == 'North America']
df_South_America = drinks[drinks.continent == 'South America']
df_Oceania = drinks[drinks.continent == 'Oceania']

### ASIA

###### From ASIA the country with the highest beer_servings is

In [19]:
df_Asia.loc[df_Asia.beer_servings == max(df_Asia.beer_servings),'country']

141    Russian Federation
Name: country, dtype: object

###### From ASIA the country with the highest spirit_servings is

In [20]:
df_Asia.loc[df_Asia.spirit_servings  == max(df_Asia.spirit_servings ),'country']

141    Russian Federation
Name: country, dtype: object

###### From ASIA the country with the wine_servings is

In [21]:
df_Asia.loc[df_Asia.wine_servings  == max(df_Asia.wine_servings ),'country']

92    Laos
Name: country, dtype: object

## AFRICA

###### From Africa the country with the highest beer_servings is

In [22]:
df_Africa.loc[df_Africa.beer_servings == max(df_Africa.beer_servings),'country']

117    Namibia
Name: country, dtype: object

###### From Africa the country with the highest spirit_servings is

In [23]:
df_Africa.loc[df_Africa.spirit_servings  == max(df_Africa.spirit_servings ),'country']

96    Liberia
Name: country, dtype: object

###### From Africa the country with the highest wine_servings is

In [24]:
df_Africa.loc[df_Africa.wine_servings  == max(df_Africa.wine_servings ),'country']

55    Equatorial Guinea
Name: country, dtype: object

##  EUROPE

###### From Europe the country with the highest beer_servings is

In [25]:
df_Europe.loc[df_Europe.beer_servings == max(df_Europe.beer_servings),'country']

45    Czech Republic
Name: country, dtype: object

###### From Europe the country with the highest spirit_servings is

In [26]:
df_Europe.loc[df_Europe.spirit_servings == max(df_Europe.spirit_servings),'country']

15    Belarus
Name: country, dtype: object

###### From Europe the country with the highest wine_servings is

In [27]:
df_Europe.loc[df_Europe.wine_servings == max(df_Europe.wine_servings),'country']

61    France
Name: country, dtype: object

## NORTH AMERICA

###### From North_America the country with the highest beer_servings is

In [28]:
df_North_America.loc[df_North_America.beer_servings == max(df_North_America.beer_servings),'country']

130    Panama
Name: country, dtype: object

###### From North_America the country with the highest spirit_servings is

In [29]:
df_North_America.loc[df_North_America.spirit_servings == max(df_North_America.spirit_servings),'country']

68    Grenada
Name: country, dtype: object

###### From North_America the country with the highest wine_servings is

In [30]:
df_North_America.loc[df_North_America.wine_servings == max(df_North_America.wine_servings),'country']

32    Canada
Name: country, dtype: object

## SOUTH AMERICA

###### From South_America the country with the highest beer_servings is

In [31]:
df_South_America.loc[df_South_America.beer_servings == max(df_South_America.beer_servings),'country']

188    Venezuela
Name: country, dtype: object

###### From South_America the country with the highest spirit_servings is

In [32]:
df_South_America.loc[df_South_America.spirit_servings == max(df_South_America.spirit_servings),'country']

72    Guyana
Name: country, dtype: object

###### From South_America the country with the highest wine_servings is

In [33]:
df_South_America.loc[df_South_America.wine_servings == max(df_South_America.wine_servings),'country']

6    Argentina
Name: country, dtype: object

## OCEANIA

###### From Oceania the country with the highest beer_servings is

In [34]:
df_Oceania.loc[df_Oceania.beer_servings == max(df_Oceania.beer_servings),'country']

129    Palau
Name: country, dtype: object

###### From  Oceania the country with the highest spirit_servings is

In [35]:
df_Oceania.loc[df_Oceania.spirit_servings == max(df_Oceania.spirit_servings),'country']

40    Cook Islands
Name: country, dtype: object

###### From  Oceania the country with the highest wine_servings is

In [36]:
df_Oceania.loc[df_Oceania.wine_servings == max(df_Oceania.wine_servings),'country']

8    Australia
Name: country, dtype: object

# Question 5

###### In West Africa which country has the lowest total liters of alcohol?

In [37]:
#creating a dataframe of only wester_african countries

lst_w_Africa = ['Benin','Mali','Burkina Faso','Mauritania','Ivory Coast','Niger','Cape Verde','Nigeria','Gambia','Senegal','Ghana','Sierra Leone','Guinea','Saint Helena','Guinea Bissau','Sou Tome &Principe','Liberia','Togo']

df_Africa.country.isin(lst_w_Africa)

w_Africa =df_Africa [df_Africa.country.isin(lst_w_Africa )]

# w_Africa

In [38]:
# West African  country with the lowest total liters of alcohol
w_Africa.loc[w_Africa.total_litres_of_pure_alcohol == min(w_Africa.total_litres_of_pure_alcohol),'country' ]

107    Mauritania
Name: country, dtype: object

# Question 6

###### In East Africa which country has the highest intake of alcohol?

In [39]:
#creating a dataframe of only easter_african countries
lst_E_Africa = ['Mozambique','Madagascar','Malawi','Zambia','Zimbabwe','Comoros','Mauritius','Seychelles','Reunion','Mayotte']
df_Africa.country.isin(lst_E_Africa)
E_Africa =df_Africa [ df_Africa.country.isin(lst_E_Africa )]
E_Africa

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,b_s_servings
38,Comoros,1,3,1,0.1,Africa,4
100,Madagascar,26,15,4,0.8,Africa,41
101,Malawi,8,11,1,1.5,Africa,19
108,Mauritius,98,31,18,2.6,Africa,129
115,Mozambique,47,18,5,1.3,Africa,65
152,Seychelles,157,25,51,4.1,Africa,182
191,Zambia,32,19,4,2.5,Africa,51
192,Zimbabwe,64,18,4,4.7,Africa,82

In [40]:
# West African  country with the highest intake of alcohol
E_Africa.loc[E_Africa.total_litres_of_pure_alcohol == max(E_Africa.total_litres_of_pure_alcohol),'country' ]
#referred to total litres of alcohl

192    Zimbabwe
Name: country, dtype: object

# Question 7

###### From the titanic data-set what is the average age of the survivors, what was the most common Pclass and Sex.

In [41]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [42]:
# the average age of the survivors

titanic_train_survivors = titanic_train[titanic_train.Survived == 1]
# titanic_train_survivors
titanic_train_survivors.Age.mean()

28.343689655172415

### OR

In [43]:
# the average age of the survivors
a = titanic_train_survivors.Age.dropna().tolist()
lambda x,y: x+y
sum_lst = reduce(lambda x,y: x+y,a)
avrg = sum_lst/len(a)
print(avrg)

28.343689655172415

###### the most common Pclass OF SURVIVORS in titanic data

In [44]:
titanic_train_survivors.Pclass.mode()

0    1
dtype: int64

###### the most common sex OF SURVIVORS in titanic data

In [45]:
titanic_train_survivors.Sex.mode()

0    female
dtype: object

# Question 8
###### Which sex recorded the most survivors according to the titanic data-set?

In [46]:
titanic_train_survivors.Sex.mode()

0    female
dtype: object

# Question 9
###### In North Africa which country drinks most?

In [47]:
# dataframe for only countries fron north Africa

lst_N_Africa = ['Algeria','Egypty','Libya','Morroco','Sudan','Tunisia','Western Sahara']
df_Africa.country.isin(lst_N_Africa)
N_Africa =df_Africa [ df_Africa.country.isin(lst_N_Africa )]
# N_Africa

In [48]:
# North African country wich drinks most

N_Africa['t_N_Africa_consumption'] = (N_Africa.beer_servings+N_Africa.spirit_servings+N_Africa.wine_servings+N_Africa.total_litres_of_pure_alcohol)
N_Africa.loc[N_Africa.t_N_Africa_consumption == max(N_Africa.t_N_Africa_consumption),'country']

/home/germain/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

175    Tunisia
Name: country, dtype: object

# Question 10
###### From the SADAC block which country is the third most consumer of Alcohol?

In [49]:
N_Africa['t_N_Africa_consumption'] = (N_Africa.beer_servings+N_Africa.spirit_servings+N_Africa.
                                      wine_servings+N_Africa.total_litres_of_pure_alcohol)

/home/germain/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [50]:
lst_SADAC = ['Angola','Botswana','Comoros','Democratic Republic of Congo','Eswatini','Lesotho','Madagascar','Malawi','Mauritius','Mozambique','Namimbia','Seychelles','South Africa','United Republic of Tanzania','Zambia','Zimbabwe',]
df_Africa.country.isin(lst_SADAC)
SADAC =df_Africa [ df_Africa.country.isin(lst_SADAC )]
# SADAC
SADAC['t_N_Africa_consumption'] = (SADAC.beer_servings+SADAC.spirit_servings+SADAC.wine_servings+
                                   SADAC.total_litres_of_pure_alcohol)
# SADAC
SADAC.t_N_Africa_consumption.sort_values(ascending = False).tolist()[2]
SADAC.loc[SADAC.t_N_Africa_consumption == SADAC.t_N_Africa_consumption.sort_values(ascending = False).tolist()[2], 'country']

/home/germain/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

22    Botswana
Name: country, dtype: object

# Question 11
###### From the UFO data-set what is the overall memory usage? Which column has the highest share of memory? How can u reduce the memory usage of some of the columns for this data set? How much have you reduced the memory usage for the data-frame? Explain your findings with code.

In [194]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

###### UFO data-set  overall memory usage

In [58]:
ufo.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null object
dtypes: object(5)
memory usage: 5.1 MB

 ###### column with the highest share of memory?

In [118]:
ufo.memory_usage(deep = True)

Index                   80
City               1205618
Colors Reported     671313
Shape Reported     1065230
State              1076219
Time               1307165
dtype: int64

In [86]:
ufo.City.memory_usage(deep= True)

1205698

# Question 12
###### Which country from the G7 has the lowest total intake of Alcohol?

In [182]:
lsr_G7 = ['France','USA','Japan','Canada','Italy','United Kingdom','Germany']
drinks.country.isin(lsr_G7)
G7 =drinks [ drinks.country.isin(lsr_G7 )]
# G7
G7['t_G7_consumption'] = (G7.beer_servings+G7.spirit_servings+G7.wine_servings+G7.total_litres_of_pure_alcohol)
# G7
G7.loc[G7.t_G7_consumption == min(G7.t_G7_consumption),'country']

/home/germain/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """

85    Japan
Name: country, dtype: object

# Qestion 13
###### Which movies have the highest percentage via content_rating and genre.

In [171]:
movies.head()
# (movies.groupby('content_rating').size()/movies['content_rating'].count())*100
# (movies.groupby('genre').size()/movies['genre'].count())*100
# movies.content_rating

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

# not understanding the question number 13

# Question 14
###### Split your movies data-set into 2 parts called train with 70 percent of the data and test with 30 percent of the data. How many records does each of the splits have?

In [138]:
movies1 = movies.copy()
train = movies1.sample(frac=0.7, random_state=0)
test = movies1.drop(train.index)

In [146]:
# number of records in train 
print('They are {} records in test split'.format(len(train)))

They are 685 records in test split

In [145]:
# number of records in test 
print('They are {} records in test split'.format(len(test)))

They are 294 records in test split

# Question 15

###### From the dataset “daily-total-female-births.csv” which month , day of the week, day of the month and number of day of the year has the highest number of births?

In [170]:
female_births.head()

        Date  Births
0 1959-01-01      35
1 1959-01-02      32
2 1959-01-03      30
3 1959-01-04      31
4 1959-01-05      44

In [169]:
female_births['Date']= female_births['Date'].apply(pd.to_datetime)
# ufo.Time.dt.hour
date = female_births.loc[female_births.Births == female_births.Births.max(),'Date']
# date.dt.month #month
# date.dt.week #week
# date.dt.day #day
# date.dt.year #year
#  #day of the week
# date.dt.weekday_name
# date.dt.dayofweek
# date.dt.dayofyear
# date.dt.daysinmonth
# date.dt.date

In [154]:
date.dt.month #  month with highest number of births

265    9
Name: Date, dtype: int64

In [192]:
# day of the week with highest number of births
date.dt.weekday # is 2 but corresponds to Wednesday

265    2
Name: Date, dtype: int64

In [162]:
# day of the year with highest number of births
date.dt.dayofyear

265    266
Name: Date, dtype: int64

In [163]:
# quarter of the year with highest number of births
date.dt.quarter

265    3
Name: Date, dtype: int64